### AWS RDS
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.vpc: Reading...
data.aws_vpc.vpc: Read complete after 1s [id=vpc-0843225ec95e6a5ad]
data.aws_subnets.subnets: Reading...
aws_security_group.db_sg: Refreshing state... [id=sg-07519825ec0f80816]
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
data.aws_subnet.subnet["subnet-080a0209e362151be"]: Reading...
data.aws_subnet.subnet["subnet-0e35dca61b9377eec"]: Reading...
data.aws_subnet.subnet["subnet-0e0f39503e9fb3625"]: Reading...
data.aws_subnet.subnet["subnet-0f7f60d1b686e8039"]: Reading...
data.aws_subnet.subnet["subnet-069204807e3fc08ba"]: Reading...
data.aws_subnet.subnet["subnet-09702c851b7a14409"]: Reading...
aws_db_instance.rds["customer"]: Refreshing state... [id=db-D57TMFC3A4ZE5WOB3W7BJUO5UM]
aws_db_instance.rds["products"]: Refreshing state... [id=db-35UD2BT655DVLLEXOBPSVPJLVY]
aws_db_instance.rds["orders"]: Refreshing state... [id=db-6YJVQW32DFYHY3FQBMXWOWEJEM]
data.aws_subnet.subnet["subnet-0e0f39503e9fb3625"]: Read complete after 0s [id=subnet-0e0f39503e9fb3625]
data.aws_subnet.subnet["subnet-080a0209e362151be"]: Read complete after 0s [id=subnet-080a0209e362151be]
data.aws_subnet.subnet["subnet-0f7f60d1b686e8039"]: Read complete after 0s [id=subnet-0f7f60d1b686e8039]
data.aws_subnet.subnet["subnet-0e35dca61b9377eec"]: Read complete after 0s [id=subnet-0e35dca61b9377eec]
data.aws_subnet.subnet["subnet-09702c851b7a14409"]: Read complete after 0s [id=subnet-09702c851b7a14409]
data.aws_subnet.subnet["subnet-069204807e3fc08ba"]: Read complete after 0s [id=subnet-069204807e3fc08ba]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.rds["customer"] must be replaced
-/+ resource "aws_db_instance" "rds" {
      ~ address                               = "customer-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:045628470274:db:customer-database" -> (known after apply)
      ~ availability_zone                     = "us-east-1a" -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ db_subnet_group_name                  = "default" -> (known after apply)
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "customer-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "14.15" -> (known after apply)
      ~ hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-D57TMFC3A4ZE5WOB3W7BJUO5UM" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      ~ latest_restorable_time                = "2025-02-17T00:29:41Z" -> (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:postgres-14" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-D57TMFC3A4ZE5WOB3W7BJUO5UM" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "deleting" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
        tags                                  = {
            "Env"  = "Production"
            "Name" = "Banco customer"
        }
      + timezone                              = (known after apply)
        # (29 unchanged attributes hidden)
    }

  # aws_db_instance.rds["orders"] must be replaced
-/+ resource "aws_db_instance" "rds" {
      ~ address                               = "order-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:045628470274:db:order-database" -> (known after apply)
      ~ availability_zone                     = "us-east-1f" -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ db_subnet_group_name                  = "default" -> (known after apply)
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "order-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "14.15" -> (known after apply)
      ~ hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-6YJVQW32DFYHY3FQBMXWOWEJEM" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      ~ latest_restorable_time                = "2025-02-17T00:29:34Z" -> (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:postgres-14" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-6YJVQW32DFYHY3FQBMXWOWEJEM" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "deleting" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
        tags                                  = {
            "Env"  = "Production"
            "Name" = "Banco orders"
        }
      + timezone                              = (known after apply)
        # (29 unchanged attributes hidden)
    }

  # aws_db_instance.rds["products"] must be replaced
-/+ resource "aws_db_instance" "rds" {
      ~ address                               = "products-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-1:045628470274:db:products-database" -> (known after apply)
      ~ availability_zone                     = "us-east-1a" -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ db_subnet_group_name                  = "default" -> (known after apply)
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "products-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "14.15" -> (known after apply)
      ~ hosted_zone_id                        = "Z2R2ITUGPM61AM" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-35UD2BT655DVLLEXOBPSVPJLVY" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      ~ latest_restorable_time                = "2025-02-17T00:29:35Z" -> (known after apply)
      ~ license_model                         = "postgresql-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:postgres-14" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 5432 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-35UD2BT655DVLLEXOBPSVPJLVY" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "deleting" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
        tags                                  = {
            "Env"  = "Production"
            "Name" = "Banco products"
        }
      + timezone                              = (known after apply)
        # (29 unchanged attributes hidden)
    }

  # aws_security_group.db_sg will be updated in-place
  ~ resource "aws_security_group" "db_sg" {
        id                     = "sg-07519825ec0f80816"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0eef7d34d23dc6788",
                ]
              - self             = false
              - to_port          = 5432
                # (1 unchanged attribute hidden)
            },
            # (1 unchanged element hidden)
        ]
        name                   = "SG-DB-instance-tech-challenge-lanchonete"
        tags                   = {}
        # (8 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ rds_endpoints         = {
      ~ customer = "customer-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ orders   = "order-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
      ~ products = "products-database.ccyadp9cu3n9.us-east-1.rds.amazonaws.com:5432" -> (known after apply)
    }
  ~ rds_ports             = {
      ~ customer = 5432 -> (known after apply)
      ~ orders   = 5432 -> (known after apply)
      ~ products = 5432 -> (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @vitorrafael, Action: `pull_request`*